809	7212
623	5681
266	5406
256	5327
172	5265
14	5000
852	4739
399	4398
832	4395
382	4372
842	4328
521	4296
48	4112
439	4081
582	3997
204	3845
338	3756
514	3398
654	3312
569	3144
556	3021
834	2976
231	2971
363	2774
661	2752
355	2664
66	2613
697	2603
305	2274
538	2270
290	2188
449	2164
432	2151
700	2067
461	2036
374	2004
34	1959
343	1886
779	1840
91	1832
313	1821
149	1818
138	1752
113	1717
504	1592
498	1566
160	1561
106	1518
289	1510
7	1473
47	1447
437	1425
478	1418
54	1413
12	1373
823	1361
501	1354
545	1348
162	1347
132	1339
856	1338
487	1327
145	1296
493	1294
737	1286
56	1283
200	1278
784	1270
470	1255
494	1242
169	1216
300	1173
320	1091
769	1064
728	1020
488	1008
477	998
717	989
405	987
740	944
548	943
419	913
614	898
136	893
243	893
122	882
265	873
38	866
19	841
453	839
421	825
400	822
411	820
636	805
624	794
851	775
433	756
345	746
221	720
180	713
537	707
550	699
667	691
591	689
156	689
660	676
445	672
171	671
335	653
777	648
358	636
532	631
397	626
395	614
691	609
785	597
657	595
618	593
789	593
176	593
142	582
187	579
270	575
651	571
39	565
549	554
78	547
261	545
50	541
51	533
398	529
571	525
424	518
641	516
579	510
690	510
458	507
502	505
608	503
389	502
361	498
20	485
524	485
402	478
161	477
333	471
408	469
542	466
351	447
446	446
357	438
285	437
391	428
788	424
463	422
369	421
125	420
278	420
838	416
807	411
761	410
229	410
522	408
471	407
486	388
282	387
259	386
843	386
758	382
519	375
386	372
617	371
818	369
71	366
422	366
116	366
455	353
257	349
327	343
105	343
196	340
192	339
655	336
755	332
293	324
596	324
647	318
442	317
107	315
794	311
827	310
672	309
520	306
754	303
689	301
601	300
213	298
786	293
750	291
733	283
80	282
17	281
711	278
703	277
197	276
326	276
426	274
800	274
273	272
404	270
767	270
26	268
59	266
315	265
240	261
497	260
346	257
52	255
735	253
212	252
247	252
575	248
414	246
473	244
190	244
808	242
483	241
291	235
188	231
36	227
607	226
372	226
306	221
185	220
435	218
628	213
64	212
31	211
90	207
100	206
330	200
746	198
643	197
93	195
321	194
759	193
128	191
770	191
511	190
1	190
317	189
506	189
284	188
276	185
830	182
670	182
42	178
234	178
634	177
706	176
378	173
625	173
679	172
649	172
724	171
227	171
622	171
578	170
394	169
362	169
650	168
354	165
8	161
531	161
288	161
79	158
359	157
825	157
468	156
311	156
815	156
806	152
63	151
512	148
33	147
734	146
112	146
496	146
797	145
829	145
561	145
491	144
5	143
194	143
492	142
574	142
621	141
95	141
238	141
676	141
763	141
390	141
409	140
583	138
115	138
21	137
837	136
637	136
37	136
776	133
438	132
440	132
499	131
281	131
436	131
342	130
146	130
401	129
130	128
217	128
310	128
376	127
460	126
659	125
295	125
164	124
627	124
753	123
88	123
416	123
198	123
302	122
61	122
772	122
85	122
516	122
175	121
589	121
230	121
613	121
787	120
367	120
9	120
517	119
775	119
292	119
742	119
83	119
184	118
181	118
666	118
580	118
533	117
340	117
312	116
557	116
587	115
722	115
476	115
27	114
680	114
828	113
462	113
301	113
201	112
74	112
393	112
518	112
505	112
605	112
134	111
479	111
539	111
469	111
821	111
576	111
375	110
633	110
535	110
170	109
590	109
118	109
127	109
712	109
464	108
296	108
586	107
207	107
768	107
329	107
101	107
686	106
219	106
612	105
782	105
0	105
503	105
316	105
609	104
602	104
431	104
174	104
443	103
684	103
588	103
264	103
741	102
117	102
570	102
814	101
791	101
99	101
721	101
388	101
813	100
599	100
199	100
598	100
139	100
123	100
745	100
4	99
417	99
277	99
846	98
597	98
447	98
699	98
454	98
430	98
801	98
739	98
228	98
566	97
551	97
22	97
766	97
853	97
155	97
723	97
183	97
151	97
332	96
593	96
727	96
635	96
120	96
148	96
28	95
626	95
541	95
620	95
347	95
835	95
725	95
448	95
665	95
472	95
749	95
798	94
848	94
783	94
360	94
89	94
820	94
707	94
719	94
96	94
232	93
543	93
403	93
615	93
299	93
839	93
287	93
434	92
307	92
309	92
559	92
249	92
527	92
25	92
368	92
60	91
547	91
757	91
732	91
412	91
366	91
652	91
121	91
193	91
780	91
384	91
546	91
822	91
81	90
252	90
262	90
370	90
577	90
456	90
765	90
850	90
35	90
687	90
695	90
189	90
528	90
482	90
648	90
630	90
751	89
811	89
3	89
560	89
114	89
611	89
294	89
206	88
600	88
793	88
555	88
500	88
159	88
632	88
214	88
179	88
140	88
331	88
356	88
685	88
584	87
565	87
485	87
202	87
45	87
337	87
318	87
350	87
237	87
572	87
736	87
692	87
233	87
303	86
523	86
747	86
771	86
803	86
371	86
69	86
76	86
92	86
387	86
280	86
319	86
534	85
428	85
716	85
854	85
314	85
553	85
70	85
13	85
812	85
682	85
844	85
364	85
208	85
762	85
696	85
752	85
297	85
244	85
441	85
540	85
554	84
490	84
267	84
799	84
573	84
348	84
429	84
773	84
810	84
251	84
513	84
191	84
268	84
274	84
675	84
804	84
849	84
639	84
137	83
218	83
585	83
774	83
581	83
226	83
694	83
103	83
109	83
847	83
610	83
544	83
157	83
29	83
688	83
656	82
731	82
530	82
778	82
163	82
748	82
108	82
603	82
595	82
674	82
94	82
452	82
24	82
341	82
664	82
86	82
831	82
781	82
756	82
11	82
210	82
663	82
224	82
729	81
795	81
104	81
165	81
413	81
220	81
111	81
57	81
526	81
72	81
269	81
760	81
49	81
248	81
23	81
738	81
529	81
568	81
668	81
525	81
704	81
322	80
638	80
718	80
373	80
325	80
407	80
855	80
10	80
65	80
418	80
58	80
845	79
215	79
713	79
147	79
515	79
457	79
484	79
495	79
211	79
536	79
805	79
836	79
702	79
379	79
562	79
167	79
646	79
15	79
563	78
678	78
286	78
567	78
6	78
239	78
743	78
16	78
102	78
352	78
826	78
124	78
143	78
246	78
619	78
55	78
339	78
420	78
592	78
245	78
796	78
833	78
507	78
705	78
631	78
604	78
195	77
2	77
216	77
714	77
30	77
645	77
383	77
235	77
154	77
271	77
377	77
344	77
263	77
642	77
840	77
308	77
644	77
144	77
62	77
324	77
726	77
677	76
673	76
510	76
819	76
53	76
178	76
336	76
43	76
225	76
710	76
365	76
141	76
465	76
427	75
279	75
254	75
75	75
182	75
97	75
475	75
629	75
857	75
68	75
744	75
44	75
509	75
349	75
152	75
824	75
77	75
150	75
606	74
87	74
459	74
323	74
790	74
205	74
658	74
720	74
423	74
385	74
662	74
474	74
223	74
683	74
126	74
640	74
260	73
209	73
701	73
817	73
173	73
841	73
133	72
272	72
410	72
153	72
18	72
258	72
425	72
203	72
681	72
730	72
275	72
304	71
334	71
709	71
671	71
283	71
255	71
84	71
450	71
110	71
353	71
119	71
451	71
552	71
32	71
481	71
40	70
392	70
82	70
222	70
564	70
764	69
298	69
594	69
67	69
73	69
653	68
669	68
253	68
467	68
396	68
715	68
406	68
41	67
236	67
802	67
250	67
129	66
98	66
616	66
444	66
489	66
135	66
166	65
792	65
508	65
242	64
131	64
46	63
558	63
158	63
241	63
480	62
186	62
168	61
466	60
708	60
816	58
